tutorials/A.Jacobsen-2026/CasseBB/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;



Ny		NY;
Nz		1;
tPe		TPE;
tDi		TDI;
tNe		TNE;
tC_      TCC;
cellLength	LC;
cellDepth	WC;
inletL		5;
outletL		5;

S1 SS1;
SDi	SDI;

t01 #eval #{ -$tC_ #};
t2 #eval #{ $tPe+$tDi #};
t3 #eval #{ $tPe+$tDi+$tNe #};
t4 #eval #{ $t3+$tC_ #};
inletx #eval #{ -1*$inletL #};
outletx	#eval #{ $cellLength+$outletL #};

dyPe	RPE;
dyNe	RPE;

dyDiNe	RDI;	
dyDiPe	RDI;

dx	2;


Nx  #eval #{ round($cellLength/($t3*$S1) *$Ny) #};
NInlet  #eval #{ round($inletL/($t3*$S1) *$Ny) #};
NOutlet  #eval #{ round($outletL/($t3*$S1) *$Ny) #};


NyPE #eval #{ round($tPe/($t3)*$Ny) #};
NyNE #eval #{ round($tNe/($t3)*$Ny) #};
NyD #eval #{ round($tDi/($t3)*$Ny*$SDi) #};

vertices
(
//positiveElectrode
    (0 			0 		0)   		//0
    ($cellLength 	0 		0)		//1
    ($cellLength 	$tPe 		0)		//2
    (0 			$tPe		0)		//3
    (0 			0 		$cellDepth)	//4
    ($cellLength 	0 		$cellDepth)	//5
    ($cellLength 	$tPe 		$cellDepth)	//6
    (0 			$tPe 		$cellDepth)	//7
//diaphrame    
    (0 			$t2		0)   		//8
    ($cellLength 	$t2 		0)		//9
    (0	 		$t2  		$cellDepth)	//10
    ($cellLength	$t2		$cellDepth)	//11
//negativeDiaphram
    (0 			$t3		0)		//12
    ($cellLength 	$t3 		0)		//13
    (0	 		$t3 		$cellDepth)	//14
    ($cellLength 	$t3 		$cellDepth)	//15
//positive inlet
    ($inletx		0		0)		//16
    ($inletx		$t01		0)		//17
    ($inletx		0		$cellDepth)	//18
    ($inletx		$t01		$cellDepth)	//19
//positive outlet
    ($outletx		0		0)		//20
    ($outletx		$t01		0)		//21
    ($outletx		0		$cellDepth)	//22
    ($outletx		$t01		$cellDepth)	//23
//negative inlet
    ($inletx		$t3		0)		//24
    ($inletx		$t4		0)		//25
    ($inletx		$t3		$cellDepth)	//26
    ($inletx		$t4		$cellDepth)	//27

//negative outlet
    ($outletx		$t3		0)		//28
    ($outletx		$t4		0)		//29
    ($outletx		$t3		$cellDepth)	//30
    ($outletx		$t4		$cellDepth)	//31
//positive back channel
    (0 			$t01 		0)   		//32
    ($cellLength 	$t01 		0)		//33
    (0 			$t01 		$cellDepth)	//34
    ($cellLength 	$t01 		$cellDepth)	//35
 //negative back channel
    (0 			$t4 		0)   		//36
    ($cellLength 	$t4 		0)		//37
    (0 			$t4 		$cellDepth)	//38
    ($cellLength 	$t4 		$cellDepth)	//39   
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 	positiveElectode 	($Nx $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (3 2 9 8 7 6 11 10) 	diaphram 		($Nx $NyD $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyDiPe)(0.5 0.5 #eval #{ 1/$dyDiNe #}))  1)
    hex (8 9 13 12 10 11 15 14) negativeElectode 	($Nx $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    
    hex (17 32 0 16 19 34 4 18) positiveChannel	($NInlet $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (24 12 36 25 26 14 38 27) negativeChannel	($NInlet $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    hex (33 21 20 1 35 23 22 5) positiveChannel	($NOutlet $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (13 28 29 37 15 30 31 39) negativeChannel	($NOutlet $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    
    hex (32 33 1 0 34 35 5 4) positiveChannel ($Nx $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (12 13 37 36 14 15 39 38) negativeChannel 	($Nx $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
);
//x - ((0.1 0.15 4)(0.8 0.7 1)(0.1 0.15 0.25))
//y - ((0.2 0.3 4)(0.6 0.4 1)(0.2 0.3 0.25)) 
edges
(
);

boundary
(
/*
    PNe
    {
        type wall;
        faces
        (
            (12 14 15 13)
        );
    }

    PPe
    {
	type wall;
	faces
	(
	    (1 5 4 0)
	);
	
    }*/
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (2 3 8 9)
            (9 8 12 13)
            (7 10 11 6)
            (11 10 14 15)
            (1 20 21 33)
            (5 22 23 35)
            (13 28 29 37)
            (15 30 31 39)
            (24 12 36 25)
            (26 14 38 27)
            (17 32 0 16)
            (19 34 4 18)
            (32 33 1 0)
            (34 35 5 4)
            (12 13 37 36)
            (14 15 39 38)
        );
    }
    
    Outlet1
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    Outlet2
    {
        type patch;
        faces
        (
            (28 29 31 30)
        );
    }
    Inlet1
    {
        type patch;
        faces
        (
            (16 17 19 18)
        );
    }
    Inlet2
    {
        type patch;
        faces
        (
                (24 25 27 26)
        );
    }

    Walls
    {
    	type wall;
    	faces
    	(
    	      (2 9 11 6)
    	      (7 10 8 3)
    	      (16 0 4 18)
    	      (17 32 34 19)
    	      (24 12 14 26)
    	      (25 36 38 27)
    	      (1 20 22 5)
    	      (33 21 23 35)
    	      (13 28 30 15)
    	      (37 29 31 39)
    	      (32 33 35 34)
    	      (36 37 39 38)
    	      (0 3 7 4)
    	      (8 12 14 10)
    	      (1 2 6 5)
    	      (9 13 15 11)
        );
    }

   
);

// ************************************************************************* //
